InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_SR.h
/**
 *
 * @file SYSCTL_RegisterDefines_SR.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 24 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 24 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_SR_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_SR_H_

#include <stdint.h>

/******************************************************************************************
************************************42 SRWD *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRWD_R_WDT0_MASK         ((uint32_t)0x00000001u)
#define SYSCTL_SRWD_R_WDT0_BIT          (0u)
#define SYSCTL_SRWD_R_WDT0_NORESET    ((uint32_t)0x00000000u)
#define SYSCTL_SRWD_R_WDT0_RESET      ((uint32_t)0x00000001u)

#define SYSCTL_SRWD_WDT0_MASK           ((uint32_t)0x00000001u)
#define SYSCTL_SRWD_WDT0_NORESET      ((uint32_t)0x00000000u)
#define SYSCTL_SRWD_WDT0_RESET        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWD_R_WDT1_MASK         ((uint32_t)0x00000002u)
#define SYSCTL_SRWD_R_WDT1_BIT          (1u)
#define SYSCTL_SRWD_R_WDT1_NORESET    ((uint32_t)0x00000000u)
#define SYSCTL_SRWD_R_WDT1_RESET      ((uint32_t)0x00000002u)

#define SYSCTL_SRWD_WDT1_MASK           ((uint32_t)0x00000001u)
#define SYSCTL_SRWD_WDT1_NORESET      ((uint32_t)0x00000000u)
#define SYSCTL_SRWD_WDT1_RESET        ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************43 SRTIMER *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRTIMER_R_TIMER0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_R_TIMER0_BIT         (0u)
#define SYSCTL_SRTIMER_R_TIMER0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRTIMER_TIMER0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRTIMER_R_TIMER1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRTIMER_R_TIMER1_BIT         (1u)
#define SYSCTL_SRTIMER_R_TIMER1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRTIMER_TIMER1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRTIMER_R_TIMER2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRTIMER_R_TIMER2_BIT         (2u)
#define SYSCTL_SRTIMER_R_TIMER2_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER2_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRTIMER_TIMER2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER2_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER2_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRTIMER_R_TIMER3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRTIMER_R_TIMER3_BIT         (3u)
#define SYSCTL_SRTIMER_R_TIMER3_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER3_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRTIMER_TIMER3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER3_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER3_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRTIMER_R_TIMER4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_SRTIMER_R_TIMER4_BIT         (4u)
#define SYSCTL_SRTIMER_R_TIMER4_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER4_RESET     ((uint32_t)0x00000010u)

#define SYSCTL_SRTIMER_TIMER4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER4_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER4_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRTIMER_R_TIMER5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_SRTIMER_R_TIMER5_BIT         (5u)
#define SYSCTL_SRTIMER_R_TIMER5_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_R_TIMER5_RESET     ((uint32_t)0x00000020u)

#define SYSCTL_SRTIMER_TIMER5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRTIMER_TIMER5_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRTIMER_TIMER5_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************44 SRGPIO *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRGPIO_R_GPIOA_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_R_GPIOA_BIT         (0u)
#define SYSCTL_SRGPIO_R_GPIOA_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOA_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRGPIO_GPIOA_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOA_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOA_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOB_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRGPIO_R_GPIOB_BIT         (1u)
#define SYSCTL_SRGPIO_R_GPIOB_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOB_RESET     ((uint32_t)0x00000002u)

