InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_SR.h
#define SYSCTL_SRGPIO_GPIOB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOB_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOB_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOC_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRGPIO_R_GPIOC_BIT         (2u)
#define SYSCTL_SRGPIO_R_GPIOC_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOC_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRGPIO_GPIOC_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOC_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOC_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOD_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRGPIO_R_GPIOD_BIT         (3u)
#define SYSCTL_SRGPIO_R_GPIOD_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOD_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRGPIO_GPIOD_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOD_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOD_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOE_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_SRGPIO_R_GPIOE_BIT         (4u)
#define SYSCTL_SRGPIO_R_GPIOE_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOE_RESET     ((uint32_t)0x00000010u)

#define SYSCTL_SRGPIO_GPIOE_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOE_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOE_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOF_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_SRGPIO_R_GPIOF_BIT         (5u)
#define SYSCTL_SRGPIO_R_GPIOF_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOF_RESET     ((uint32_t)0x00000020u)

#define SYSCTL_SRGPIO_GPIOF_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOF_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOF_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOG_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_SRGPIO_R_GPIOG_BIT         (6u)
#define SYSCTL_SRGPIO_R_GPIOG_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOG_RESET     ((uint32_t)0x00000040u)

#define SYSCTL_SRGPIO_GPIOG_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOG_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOG_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOG_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_SRGPIO_R_GPIOG_BIT         (6u)
#define SYSCTL_SRGPIO_R_GPIOG_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOG_RESET     ((uint32_t)0x00000040u)

#define SYSCTL_SRGPIO_GPIOG_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOG_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOG_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOH_MASK        ((uint32_t)0x00000080u)
#define SYSCTL_SRGPIO_R_GPIOH_BIT         (7u)
#define SYSCTL_SRGPIO_R_GPIOH_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOH_RESET     ((uint32_t)0x00000080u)

#define SYSCTL_SRGPIO_GPIOH_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOH_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOH_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOJ_MASK        ((uint32_t)0x00000100u)
#define SYSCTL_SRGPIO_R_GPIOJ_BIT         (8u)
#define SYSCTL_SRGPIO_R_GPIOJ_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOJ_RESET     ((uint32_t)0x00000100u)

#define SYSCTL_SRGPIO_GPIOJ_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOJ_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOJ_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOK_MASK        ((uint32_t)0x00000200u)
#define SYSCTL_SRGPIO_R_GPIOK_BIT         (9u)
#define SYSCTL_SRGPIO_R_GPIOK_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOK_RESET     ((uint32_t)0x00000200u)

#define SYSCTL_SRGPIO_GPIOK_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOK_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOK_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOL_MASK        ((uint32_t)0x00000400u)
#define SYSCTL_SRGPIO_R_GPIOL_BIT         (10u)
#define SYSCTL_SRGPIO_R_GPIOL_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOL_RESET     ((uint32_t)0x00000400u)

#define SYSCTL_SRGPIO_GPIOL_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOL_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOL_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOM_MASK        ((uint32_t)0x00000800u)
#define SYSCTL_SRGPIO_R_GPIOM_BIT         (11u)
#define SYSCTL_SRGPIO_R_GPIOM_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOM_RESET     ((uint32_t)0x00000800u)

#define SYSCTL_SRGPIO_GPIOM_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOM_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOM_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPION_MASK        ((uint32_t)0x00001000u)
#define SYSCTL_SRGPIO_R_GPION_BIT         (12u)
#define SYSCTL_SRGPIO_R_GPION_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPION_RESET     ((uint32_t)0x00001000u)

#define SYSCTL_SRGPIO_GPION_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPION_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPION_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOP_MASK        ((uint32_t)0x00002000u)
#define SYSCTL_SRGPIO_R_GPIOP_BIT         (13u)
#define SYSCTL_SRGPIO_R_GPIOP_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOP_RESET     ((uint32_t)0x00002000u)

