InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_SR.h
#define SYSCTL_SRGPIO_GPIOP_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOP_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOP_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRGPIO_R_GPIOQ_MASK        ((uint32_t)0x00004000u)
#define SYSCTL_SRGPIO_R_GPIOQ_BIT         (14u)
#define SYSCTL_SRGPIO_R_GPIOQ_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_R_GPIOQ_RESET     ((uint32_t)0x00004000u)

#define SYSCTL_SRGPIO_GPIOQ_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRGPIO_GPIOQ_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRGPIO_GPIOQ_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************45 SRDMA *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRDMA_R_UDMA_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRDMA_R_UDMA_BIT         (0u)
#define SYSCTL_SRDMA_R_UDMA_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRDMA_R_UDMA_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRDMA_UDMA_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRDMA_UDMA_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRDMA_UDMA_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************46 SRHIB *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRHIB_R_HIB_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRHIB_R_HIB_BIT         (0u)
#define SYSCTL_SRHIB_R_HIB_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRHIB_R_HIB_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRHIB_HIB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRHIB_HIB_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRHIB_HIB_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************47 SRUART *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRUART_R_UART0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_R_UART0_BIT         (0u)
#define SYSCTL_SRUART_R_UART0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRUART_UART0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRUART_R_UART1_BIT         (1u)
#define SYSCTL_SRUART_R_UART1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRUART_UART1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRUART_R_UART2_BIT         (2u)
#define SYSCTL_SRUART_R_UART2_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART2_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRUART_UART2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART2_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART2_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRUART_R_UART3_BIT         (3u)
#define SYSCTL_SRUART_R_UART3_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART3_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRUART_UART3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART3_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART3_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_SRUART_R_UART4_BIT         (4u)
#define SYSCTL_SRUART_R_UART4_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART4_RESET     ((uint32_t)0x00000010u)

#define SYSCTL_SRUART_UART4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART4_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART4_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_SRUART_R_UART5_BIT         (5u)
#define SYSCTL_SRUART_R_UART5_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART5_RESET     ((uint32_t)0x00000020u)

#define SYSCTL_SRUART_UART5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART5_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART5_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART6_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_SRUART_R_UART6_BIT         (6u)
#define SYSCTL_SRUART_R_UART6_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART6_RESET     ((uint32_t)0x00000040u)

#define SYSCTL_SRUART_UART6_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART6_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART6_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRUART_R_UART7_MASK        ((uint32_t)0x00000080u)
#define SYSCTL_SRUART_R_UART7_BIT         (7u)
#define SYSCTL_SRUART_R_UART7_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_R_UART7_RESET     ((uint32_t)0x00000080u)

#define SYSCTL_SRUART_UART7_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUART_UART7_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUART_UART7_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************48 SRSSI *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRSSI_R_SSI0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRSSI_R_SSI0_BIT         (0u)
#define SYSCTL_SRSSI_R_SSI0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_R_SSI0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRSSI_SSI0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRSSI_SSI0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_SSI0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRSSI_R_SSI1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRSSI_R_SSI1_BIT         (1u)
#define SYSCTL_SRSSI_R_SSI1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_R_SSI1_RESET     ((uint32_t)0x00000002u)

