InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_SR.h
#define SYSCTL_SRSSI_SSI1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRSSI_SSI1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_SSI1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRSSI_R_SSI2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRSSI_R_SSI2_BIT         (2u)
#define SYSCTL_SRSSI_R_SSI2_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_R_SSI2_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRSSI_SSI2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRSSI_SSI2_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_SSI2_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRSSI_R_SSI3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRSSI_R_SSI3_BIT         (3u)
#define SYSCTL_SRSSI_R_SSI3_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_R_SSI3_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRSSI_SSI3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRSSI_SSI3_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRSSI_SSI3_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************49 SRI2C *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRI2C_R_I2C0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_R_I2C0_BIT         (0u)
#define SYSCTL_SRI2C_R_I2C0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRI2C_I2C0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRI2C_R_I2C1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRI2C_R_I2C1_BIT         (1u)
#define SYSCTL_SRI2C_R_I2C1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRI2C_I2C1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRI2C_R_I2C2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRI2C_R_I2C2_BIT         (2u)
#define SYSCTL_SRI2C_R_I2C2_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C2_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRI2C_I2C2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C2_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C2_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRI2C_R_I2C3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRI2C_R_I2C3_BIT         (3u)
#define SYSCTL_SRI2C_R_I2C3_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C3_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRI2C_I2C3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C3_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C3_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRI2C_R_I2C4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_SRI2C_R_I2C4_BIT         (4u)
#define SYSCTL_SRI2C_R_I2C4_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C4_RESET     ((uint32_t)0x00000010u)

#define SYSCTL_SRI2C_I2C4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C4_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C4_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRI2C_R_I2C5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_SRI2C_R_I2C5_BIT         (5u)
#define SYSCTL_SRI2C_R_I2C5_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_R_I2C5_RESET     ((uint32_t)0x00000020u)

#define SYSCTL_SRI2C_I2C5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRI2C_I2C5_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRI2C_I2C5_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************50 SRUSB *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRUSB_R_USB_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRUSB_R_USB_BIT         (0u)
#define SYSCTL_SRUSB_R_USB_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRUSB_R_USB_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRUSB_USB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRUSB_USB_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRUSB_USB_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************51 SRCAN *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRCAN_R_CAN0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRCAN_R_CAN0_BIT         (0u)
#define SYSCTL_SRCAN_R_CAN0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRCAN_R_CAN0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRCAN_CAN0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRCAN_CAN0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRCAN_CAN0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRCAN_R_CAN1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRCAN_R_CAN1_BIT         (1u)
#define SYSCTL_SRCAN_R_CAN1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRCAN_R_CAN1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRCAN_CAN1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRCAN_CAN1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRCAN_CAN1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************52 SRADC *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRADC_R_ADC0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRADC_R_ADC0_BIT         (0u)
#define SYSCTL_SRADC_R_ADC0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRADC_R_ADC0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRADC_ADC0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRADC_ADC0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRADC_ADC0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRADC_R_ADC1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRADC_R_ADC1_BIT         (1u)
#define SYSCTL_SRADC_R_ADC1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRADC_R_ADC1_RESET     ((uint32_t)0x00000002u)

