InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_SR.h
#define SYSCTL_SRADC_ADC1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRADC_ADC1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRADC_ADC1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************53 SRACMP *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRACMP_R_ACMP_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRACMP_R_ACMP_BIT         (0u)
#define SYSCTL_SRACMP_R_ACMP_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRACMP_R_ACMP_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRACMP_ACMP_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRACMP_ACMP_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRACMP_ACMP_RESET       ((uint32_t)0x00000001u)
/*--------*/

/****************************************************************************************
************************************54 SRPWM *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRPWM_R_PWM0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRPWM_R_PWM0_BIT         (0u)
#define SYSCTL_SRPWM_R_PWM0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRPWM_R_PWM0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRPWM_PWM0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRPWM_PWM0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRPWM_PWM0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRPWM_R_PWM1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRPWM_R_PWM1_BIT         (1u)
#define SYSCTL_SRPWM_R_PWM1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRPWM_R_PWM1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRPWM_PWM1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRPWM_PWM1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRPWM_PWM1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************55 SRQEI *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRQEI_R_QEI0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRQEI_R_QEI0_BIT         (0u)
#define SYSCTL_SRQEI_R_QEI0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRQEI_R_QEI0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRQEI_QEI0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRQEI_QEI0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRQEI_QEI0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRQEI_R_QEI1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRQEI_R_QEI1_BIT         (1u)
#define SYSCTL_SRQEI_R_QEI1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRQEI_R_QEI1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRQEI_QEI1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRQEI_QEI1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRQEI_QEI1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************56 SREEPROM *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SREEPROM_R_EEPROM_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SREEPROM_R_EEPROM_BIT         (0u)
#define SYSCTL_SREEPROM_R_EEPROM_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SREEPROM_R_EEPROM_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SREEPROM_EEPROM_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SREEPROM_EEPROM_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SREEPROM_EEPROM_RESET       ((uint32_t)0x00000001u)
/*--------*/

/**********************************************************************************
************************************57 SRWTIMER *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_R_WTIMER0_BIT         (0u)
#define SYSCTL_SRWTIMER_R_WTIMER0_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER0_RESET     ((uint32_t)0x00000001u)

#define SYSCTL_SRWTIMER_WTIMER0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER0_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER0_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_SRWTIMER_R_WTIMER1_BIT         (1u)
#define SYSCTL_SRWTIMER_R_WTIMER1_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER1_RESET     ((uint32_t)0x00000002u)

#define SYSCTL_SRWTIMER_WTIMER1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER1_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER1_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_SRWTIMER_R_WTIMER2_BIT         (2u)
#define SYSCTL_SRWTIMER_R_WTIMER2_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER2_RESET     ((uint32_t)0x00000004u)

#define SYSCTL_SRWTIMER_WTIMER2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER2_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER2_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_SRWTIMER_R_WTIMER3_BIT         (3u)
#define SYSCTL_SRWTIMER_R_WTIMER3_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER3_RESET     ((uint32_t)0x00000008u)

#define SYSCTL_SRWTIMER_WTIMER3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER3_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER3_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_SRWTIMER_R_WTIMER4_BIT         (4u)
#define SYSCTL_SRWTIMER_R_WTIMER4_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER4_RESET     ((uint32_t)0x00000010u)

#define SYSCTL_SRWTIMER_WTIMER4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER4_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER4_RESET       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_SRWTIMER_R_WTIMER5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_SRWTIMER_R_WTIMER5_BIT         (5u)
#define SYSCTL_SRWTIMER_R_WTIMER5_NORESET   ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_R_WTIMER5_RESET     ((uint32_t)0x00000020u)

#define SYSCTL_SRWTIMER_WTIMER5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_SRWTIMER_WTIMER5_NORESET     ((uint32_t)0x00000000u)
#define SYSCTL_SRWTIMER_WTIMER5_RESET       ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_SR_H_ */
